/*(INNER) JOIN - это операция объединения двух таблиц в SQL, которая возвращает только те строки, 
у которых есть совпадающие значения в заданных столбцах обеих таблиц.
*/
/*(OUTER: LEFT/RIGHT) JOIN - это операция объединения двух таблиц в SQL, которая возвращает все строки из 
обеих таблиц, а также совпадающие строки из обеих таблиц.
{возвращает все строки из обеих таблиц (включая те, у которых нет совпадений).}
*/

/*GROUP BY - группирует строки по значению (используется с агригатными функциями, нельзя, чтобы атрибуты 
в селекте отличались, от написанных в GROUP BY'е
*/
